# Задайте список из нескольких чисел.
# Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.

my_list = [1, 2, 3, 4, 5, 6]
print(sum(my_list[1::2]))